# Pandas Basic Method

In [1]:
import pandas as pd

In [2]:
dictionary = {"name": ["Ali","Veli","Zübeyde","Ahmet","kubra","can"],
              "age": [12,34,56,78,None,12],
              "note": [123,456,78,87654,None,89]}

dataframe1 = pd.DataFrame(dictionary)
print(dataframe1)

      name   age     note
0      Ali  12.0    123.0
1     Veli  34.0    456.0
2  Zübeyde  56.0     78.0
3    Ahmet  78.0  87654.0
4    kubra   NaN      NaN
5      can  12.0     89.0

In [3]:
df = pd.read_csv("C:/Users/yahya/Documents/GitHub/Introduction_To_Machine_Learning_Lab/data.csv")

print(df)

    name;age;note
0      Ali;12;123
1     Veli;34;456
2   Zübeyde;56;78
3  Ahmet;78;87654
4         Kübra;;
5       Can;12;89

In [4]:
head = dataframe1.head()
print(head)

      name   age     note
0      Ali  12.0    123.0
1     Veli  34.0    456.0
2  Zübeyde  56.0     78.0
3    Ahmet  78.0  87654.0
4    kubra   NaN      NaN

In [5]:
print(dataframe1.columns)

Index(['name', 'age', 'note'], dtype='object')

In [9]:
print(dataframe1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   note    5 non-null      float64
dtypes: float64(2), object(1)
memory usage: 272.0+ bytes
None

In [7]:
print(dataframe1.dtypes)

name     object
age     float64
note    float64
dtype: object

In [8]:
print(dataframe1.describe())

             age         note
count   5.000000      5.00000
mean   38.400000  17680.00000
std    28.684491  39116.96814
min    12.000000     78.00000
25%    12.000000     89.00000
50%    34.000000    123.00000
75%    56.000000    456.00000
max    78.000000  87654.00000

# Indexing And Slicing

In [10]:
print(dataframe1["name"])

0        Ali
1       Veli
2    Zübeyde
3      Ahmet
4      kubra
5        can
Name: name, dtype: object

In [14]:
print(dataframe1.loc[:,"age"])

0    12.0
1    34.0
2    56.0
3    78.0
4     NaN
5    12.0
Name: age, dtype: float64

In [15]:
dataframe1["yeni_future"] = [1,2,3,4,5,6]

In [16]:
print(dataframe1.loc[:3,"age"])

0    12.0
1    34.0
2    56.0
3    78.0
Name: age, dtype: float64

In [17]:
print(dataframe1.loc[:3,"name":"note"])

      name   age     note
0      Ali  12.0    123.0
1     Veli  34.0    456.0
2  Zübeyde  56.0     78.0
3    Ahmet  78.0  87654.0

In [18]:
print(dataframe1.loc[::-1])

      name   age     note  yeni_future
5      can  12.0     89.0            6
4    kubra   NaN      NaN            5
3    Ahmet  78.0  87654.0            4
2  Zübeyde  56.0     78.0            3
1     Veli  34.0    456.0            2
0      Ali  12.0    123.0            1

In [19]:
filtre1 = dataframe1.age>10
dataframe1["bool"] = filtre1
print(dataframe1.loc[:,["age","bool"]])

    age   bool
0  12.0   True
1  34.0   True
2  56.0   True
3  78.0   True
4   NaN  False
5  12.0   True

In [20]:
filtre2 = dataframe1.note>100
filtrelenmis_data2 = dataframe1[filtre2&filtre1]
print(filtrelenmis_data2)

    name   age     note  yeni_future  bool
0    Ali  12.0    123.0            1  True
1   Veli  34.0    456.0            2  True
3  Ahmet  78.0  87654.0            4  True

# Filtering Pandas DataFrame

In [21]:
dataframe1.dropna(inplace=True)
dataframe1

      name   age     note  yeni_future  bool
0      Ali  12.0    123.0            1  True
1     Veli  34.0    456.0            2  True
2  Zübeyde  56.0     78.0            3  True
3    Ahmet  78.0  87654.0            4  True
5      can  12.0     89.0            6  True

In [22]:
dataframe1["situation"]=["below average" if dataframe1.note.mean()>each else "above average" for each in dataframe1.note]
dataframe1

      name   age     note  yeni_future  bool      situation
0      Ali  12.0    123.0            1  True  below average
1     Veli  34.0    456.0            2  True  below average
2  Zübeyde  56.0     78.0            3  True  below average
3    Ahmet  78.0  87654.0            4  True  above average
5      can  12.0     89.0            6  True  below average

In [28]:
dataframe1["yeni2_future"] = [1, 1, 1, 1, 1] 


dataframe1.columns = [each.split('_')[0] + each.split('_')[1] if len(each.split('_')) > 1 else each for each in dataframe1.columns]


dataframe1

,name,age,note,yenifuture,bool,situation,yeni2future,yeni2future,yeni2future,yeni2future
0,Ali,12.0,123.0,1,True,below average,1,1,1,1
1,Veli,34.0,456.0,2,True,below average,1,1,1,1
2,Zübeyde,56.0,78.0,3,True,below average,1,1,1,1
3,Ahmet,78.0,87654.0,4,True,above average,1,1,1,1
5,can,12.0,89.0,6,True,below average,1,1,1,1

# List Comprehension

In [29]:
dataframe1.columns = [each.upper() for each in dataframe1.columns]
dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'YENIFUTURE', 'BOOL', 'SITUATION', 'YENI2FUTURE',
       'YENI2FUTURE', 'YENI2FUTURE', 'YENI2FUTURE'],
      dtype='object')

In [30]:
data1 = dataframe1.head()
data2 = dataframe1.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

,NAME,AGE,NOTE,YENIFUTURE,BOOL,SITUATION,YENI2FUTURE,YENI2FUTURE,YENI2FUTURE,YENI2FUTURE
0,Ali,12.0,123.0,1,True,below average,1,1,1,1
1,Veli,34.0,456.0,2,True,below average,1,1,1,1
2,Zübeyde,56.0,78.0,3,True,below average,1,1,1,1
3,Ahmet,78.0,87654.0,4,True,above average,1,1,1,1
5,can,12.0,89.0,6,True,below average,1,1,1,1
0,Ali,12.0,123.0,1,True,below average,1,1,1,1
1,Veli,34.0,456.0,2,True,below average,1,1,1,1
2,Zübeyde,56.0,78.0,3,True,below average,1,1,1,1
3,Ahmet,78.0,87654.0,4,True,above average,1,1,1,1
5,can,12.0,89.0,6,True,below average,1,1,1,1

In [31]:
dataframe1["new_age"] = [each*2 for each in dataframe1.AGE]
def mlt(yas):
    return yas*2
dataframe1["apply_metodu"] = dataframe1.AGE.apply(mlt)
dataframe1

,NAME,AGE,NOTE,YENIFUTURE,BOOL,SITUATION,YENI2FUTURE,YENI2FUTURE,YENI2FUTURE,YENI2FUTURE,new_age,apply_metodu
0,Ali,12.0,123.0,1,True,below average,1,1,1,1,24.0,24.0
1,Veli,34.0,456.0,2,True,below average,1,1,1,1,68.0,68.0
2,Zübeyde,56.0,78.0,3,True,below average,1,1,1,1,112.0,112.0
3,Ahmet,78.0,87654.0,4,True,above average,1,1,1,1,156.0,156.0
5,can,12.0,89.0,6,True,below average,1,1,1,1,24.0,24.0